Catalogs/ГАЛ_СтатусыЗаявокНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ГАЛ_СтатусыЗаявокНаДоставку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеЦветаМетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>R</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>G</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонEMAIL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГАЛ_СтатусыЗаявокНаДоставку/Forms/ФормаЭлементаУФ/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	RGB = ГАЛ_ДополнительныеФункцииСервер.ПолучитьАбсолютныйЦвет(НашЦвет);
	Объект.R = RGB.Красный;
	Объект.G = RGB.Зеленый;
	Объект.B = RGB.Синий;
	//Объект.ЗначениеЦвета = RGB;
КонецПроцедуры

//&НаСервере
//Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) Экспорт
//	
//	
//	
//	Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
//		Возврат ИсходныйЦвет;
//	КонецЕсли;
//	
//	ТабДок = Новый ТабличныйДокумент;
//	ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
//	Каталог = КаталогВременныхФайлов();
//	ТабДок.Записать(Каталог + "ПреобразованиеЦвета.mxl", ТипФайлаТабличногоДокумента.MXL7);
//	ТабДок.Прочитать(Каталог + "ПреобразованиеЦвета.mxl");
//	
//	АЦвет = ТабДок.Область("R1C1").ЦветФона;
//	
//	Возврат АЦвет;

//КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ТекЦвет = Новый Цвет(Объект.R,Объект.G,Объект.B);
	НашЦвет = ТекЦвет;
КонецПроцедуры

&НаСервере
Функция  ЗначениеЦветаНачалоВыбораСервер() Экспорт 
	
	Макет = Справочники.ГАЛ_СтатусыЗаявокНаДоставку.ПолучитьМакет("ЦветаМетки");	
	СписокВыбора = Новый СписокЗначений;
	Строк=7;
	НСтр=1;
	Для НомерСтроки=0 по (Строк-1) цикл
			СписокВыбора.Добавить(Макет.Область(НСтр, 1).Текст,Макет.Область(НСтр, 3).Текст,,Макет.Область(НСтр, 2).Картинка);
			НСтр=НСтр+1;
	КонецЦикла;

	Возврат СписокВыбора;  
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбора(ЗначениеВыбора, ДопПараметры) Экспорт 
	
	Объект.ЗначениеЦветаМетки = ЗначениеВыбора.Значение;
		
	//Цвет = WebЦвета[Объект.ЗначениеЦвета];
КонецПроцедуры
